---
kind: type
id: T:Autodesk.Revit.DB.BeamSystemJustifyType
source: html/2ab9e284-9fd9-eaac-ae59-c550fdcce372.htm
---
# Autodesk.Revit.DB.BeamSystemJustifyType

Describes the justify method of beamsystem.

## Syntax (C#)
```csharp
public enum BeamSystemJustifyType
```